**INSERT COMMAND**

1.INSERT : This command inserts values inside the table that is created.

Example SQL Command:

INSERT INTO employee VALUES("Priya","Bhatia",26,100000,"Bengaluru")

Example SQL Command to Insert multiple records :

 INSERT INTO employee VALUES("Priya","Bhatia",26,100000,"Bengaluru")

 INSERT INTO employee VALUES("Sumedha","Midha",32,50000,"Gurugram");

 INSERT INTO employee VALUES("Rashmi","Tanwar",30,20000,"Bengaluru");

 INSERT INTO employee VALUES("Shivam","Mishra",28,10000,"Noida");

 INSERT INTO employee VALUES("Ajay","Bhatia",25,5000,"Mumbai");

 INSERT INTO employee VALUES("Ankit","Sangwan",34,70000,"Bengaluru");


2. SELECT * : This command is used to Retrieve the Data that is inserted into the table

Example SQL Command: SELECT *FROm employee;

3. Different method to Insert records into the table:

INSERT INTO employee (FirstName,lastName,Age,Salary,Location) VALUES("Ankit","Sangwan",34,70000,"Bengaluru");

4. Method to insert records into the table by skipping a column.

INSERT INTO employee (lastName,Age,Salary,Location) VALUES("Bhatt",29,50000,"Gurugram");

**DROP Command**

Command to Drop a Particular table that is created: DROP tablename

Example: DROP employee

Command After dropping the table can check if the table exists in the Database :SHOW tables

The deleted table will not be seen in the Database.

**Create table with NOT NULL CONSTRAINT**



The column with **NOT NULL** constarint cannot be left empty without entering the data  while inserting the data into the column.

This done to avoid **"Null**" values in a specific column.

Example:

CREATE TABLE employee(
        FirstName varchar(20) NOT NULL,
		    lastName varchar(20) NOT NULL,
        Age int NOT NULL,
        Salary int NOT NULL,
        Location varchar(20) NOT NULL
);

To see the Table description that is created with the constraint:


DESC employee;


we see the table created as below:

FirstName	varchar(20)	NO		NULL
lastName	varchar(20)	NO		NULL
Age	int	NO			NULL
Salary	int	NO		NULL
Location	varchar(20)	NO	NULL

**Error seen when data is not entered for all columns with NOT NULL Constraint**

With the constraint all the column have to be filled while inserting the data into the table columns..

We will see the below error if any of the data is missing in any of the columns:


Example:
INSERT INTO employee (lastName,Age,Salary,Location)VALUES("Bhatt",29,50000,"Gurugram");

output Error: 15:31:54	INSERT INTO employee (lastName,Age,Salary,Location)VALUES("Bhatt",29,50000,"Gurugram")	Error Code: 1364. Field 'FirstName' doesn't have a default value	0.015 sec

This is seen because we donot have the data for the FirstName column

**Correct way to enter the column data for a table with NOT NULL constraint**

To insert data in a proper way below is the command which has all the columns and the corresponding for each columns:

Example:

INSERT INTO employee (FirstName,lastName,Age,Salary,Location)VALUES("Alia","Bhatt",29,50000,"Gurugram");

Creating a Table column with PRIMARY KEY

This key is not NULL by Default

This is created  to uniquely identify each record in the table.


Example :

**Method1 to create a PRIMARY KEY**

CREATE TABLE employee(
        EmpID int PRIMARY KEY,
        FirstName varchar(20) NOT NULL,
		    LastName varchar(20) NOT NULL,
        Age int NOT NULL,
        Salary int NOT NULL,
        Location varchar(20) NOT NULL
);


**Method2 to create a PRIMARY KEY**

CREATE TABLE employee(
        EmpID int ,
        FirstName varchar(20) NOT NULL,
		    LastName varchar(20) NOT NULL,
        Age int NOT NULL,
        Salary int NOT NULL,
        Location varchar(20) NOT NULL,
        PRIMARY KEY(EmpID)
);

**Insert the records into the table with the Primary key**

INSERT INTO employee VALUES("Priya","Bhatia",26,100000,"Bengaluru");
INSERT INTO employee VALUES("Sumedha","Midha",32,50000,"Gurugram");
INSERT INTO employee VALUES("Rashmi","Tanwar",30,20000,"Bengaluru");
INSERT INTO employee VALUES("Shivam","Mishra",28,10000,"Noida");
INSERT INTO employee VALUES("Ajay","Bhatia",25,5000,"Mumbai");
INSERT INTO employee VALUES("Ankit","Sangwan",34,70000,"Bengaluru");
INSERT INTO employee (FirstName,lastName,Age,Salary,Location)VALUES("Alia","Bhatt",29,50000,"Gurugram");

**Auto Increment feature** - This helps in auto increment of the primary key

Example - Table created with Auto Increment feature

CREATE TABLE employee(
        EmpID int AUTO_INCREMENT,
        FirstName varchar(20) NOT NULL,
		    LastName varchar(20) NOT NULL,
        Age int NOT NULL,
        Salary int NOT NULL,
        Location varchar(20) NOT NULL,
        PRIMARY KEY(EmpID)
);

To see the table that is created with Auto_Increment feature

Desc employee;


**The table is seen as below with Auto_Increment**

EmpID	int	NO	PRI		auto_increment

FirstName	varchar(20)	NO

LastName	varchar(20)	NO

Age	int	NO

Salary	int	NO

Location	varchar(20)	NO

**Inserting the values inside the table with Auto_Increment feature** we dont need to mention the column name "EmpID" ,as it auto Increments

Example:


INSERT INTO employee (FirstName,lastName,Age,Salary,Location) VALUES("Priya","Bhatia",26,100000,"Bengaluru");

INSERT INTO employee (FirstName,lastName,Age,Salary,Location)VALUES("Sumedha","Midha",32,50000,"Gurugram");

INSERT INTO employee (FirstName,lastName,Age,Salary,Location)VALUES("Rashmi","Tanwar",30,20000,"Bengaluru");

INSERT INTO employee (FirstName,lastName,Age,Salary,Location)VALUES("Shivam","Mishra",28,10000,"Noida");

INSERT INTO employee (FirstName,lastName,Age,Salary,Location)VALUES("Ajay","Bhatia",25,5000,"Mumbai");

INSERT INTO employee (FirstName,lastName,Age,Salary,Location)VALUES("Ankit","Sangwan",34,70000,"Bengaluru");

INSERT INTO employee (FirstName,lastName,Age,Salary,Location)VALUES("Alia","Bhatt",29,50000,"Gurugram");


**Output:**

EmpID, FirstName, LastName, Age, Salary, Location
1	Priya	Bhatia	26	100000	Bengaluru

2	Sumedha	Midha	32	50000	Gurugram

3	Rashmi	Tanwar	30	20000	Bengaluru

4	Shivam	Mishra	28	10000	Noida

5	Ajay	Bhatia	25	5000	Mumbai

6	Ankit	Sangwan	34	70000	Bengaluru

7	Alia	Bhatt	29	50000	Gurugram

**RETRIEVE only the selected column from the table**


Example:

In the below command we try to retrieve only the FirstName and LastName column data.

select FirstName,LastName from employee;

Output:

FirstName, LastName

'Ajay', 'Bhatia'
'Alia', 'Bhatt'
'Ankit', 'Sangwan'
'Priya', 'Bhatia'
'Rashmi', 'Tanwar'
'Shivam', 'Mishra'
'Sumedha', 'Midha'

**Filtering the Records using WHERE clause**

This command allows to retrieve/dispaly the records from the table that satisfies the conditions.

Example:

select FirstName,LastName from employee WHERE Salary>=50000

** Order By Clause** - This coomand allows us to retrieve the data from the table in the Ascending Order for a particular column.

The Order can be changed to Descending by mentioning the Keyword DESC while retrieving the records .


Example:


SELECT FirstName,LastName,Salary from employee where Salary>=50000 ORDER BY Salary DESC;

Output:

FirstName, LastName, Salary

'Alia', 'Bhatt', '50000'
'Ankit', 'Sangwan', '70000'
'Priya', 'Bhatia', '100000'
'Sumedha', 'Midha', '50000'


** Default Order by Command**

Example2 :

SELECT FirstName,LastName,Salary from employee where Salary>=50000 ORDER BY Salary;

FirstName, LastName, Salary

'Alia', 'Bhatt', '50000'
'Ankit', 'Sangwan', '70000'
'Priya', 'Bhatia', '100000'
'Sumedha', 'Midha', '50000'

**Understanding the ORDER OF EXECUTION of the command with Where  and Order By clause**


Example Command:


SELECT FirstName,LastName,Salary from employee where Salary>=50000 ORDER BY Salary;


***Order of Execution: ***

**from ==> where==> Select==>order by**

1. From clause is executed-->It finds from which Table to Fetch the Data
2. Where clause is Executed--> It filters teh data based on the Where Clause.
3. Select command is executed--> It fetches the specified column data.
4. Order by clause is executed--> It displays the fetched records in the specified Order.Either "Ascending" or "Descending". By Default it is "Ascending"

**Extract the Top Two Employees who get the Highest Salary using LIMIT Clause**

The LIMIT clause allows us to specify the top number of data we want to retrieve.


Example:

SELECT FirstName,LastName,Salary from employee where Salary>=50000 ORDER BY Salary DESC LIMIT 2;



***Order of Execution: ***

**from ==> where==> Select==>order by ==> LIMIT**

Output:

FirstName, LastName, Salary


Priya	Bhatia	100000
Ankit	Sangwan	70000